In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/friend_list.csv")

In [3]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [4]:
df[1:3] # index주기

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [5]:
df.loc[ [0,2 ]]

   name  age      job
0  John   20  student
2  Nate   30  teacher

## By Column Condition

In [6]:
df[df.age < 30]

    name  age      job
0   John   20  student
5  Chris   25   intern

In [7]:
df.query('age <30')

    name  age      job
0   John   20  student
5  Chris   25   intern

In [8]:
df[ (df.age > 25) & (df.name=='Julia')]

    name  age      job
3  Julia   40  dentist

## From record

In [9]:
friend_list = [
    ['Jaemin', 20, 'student'],
    ['hyunsu', 23, 'intern'],
    ['Jiwon', 25, 'no']
]
df = pd.DataFrame.from_records(friend_list)

In [10]:
df

        0   1        2
0  Jaemin  20  student
1  hyunsu  23   intern
2   Jiwon  25       no

In [11]:
df.iloc[:, 0:2]

        0   1
0  Jaemin  20
1  hyunsu  23
2   Jiwon  25

## by Column Name

In [12]:
df = pd.read_csv('data/friend_list_no_head.csv', header=None, names=['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
df_filtered = df[['name', 'age']]
df_filtered

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [14]:
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [15]:
df.filter(like='a', axis=1) # column은 언제나 axis 1

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [16]:
df.filter(regex='b$', axis=1) # regular expression

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

## Column 삭제하기

In [17]:
friends = [
    {'age' : 23, 'job':'student'},
    {'age' : 24, 'job':'soilder'},
    {'age' : 25, 'job':'intern'}
]

df = pd.DataFrame(friends, index=['Jiwon', 'Jaemin', 'Hyunsu'], columns=['age', 'job'])
df

        age      job
Jiwon    23  student
Jaemin   24  soilder
Hyunsu   25   intern

In [18]:
df.drop(['Hyunsu'])

        age      job
Jiwon    23  student
Jaemin   24  soilder

In [19]:
df.drop(['Hyunsu'], inplace=True) # 바로 적용

In [20]:
df = pd.read_csv('data/friend_list.csv')

In [21]:
df = df.drop(df.index[[0, 2]])
df

    name  age        job
1  Jenny   30  developer
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [22]:
df = pd.read_csv('data/friend_list.csv')

In [23]:
df.drop([1])

    name  age      job
0   John   20  student
2   Nate   30  teacher
3  Julia   40  dentist
4  Brian   45  manager
5  Chris   25   intern

## Column 추가하기

In [24]:
df['salary'] = 0

In [25]:
df

    name  age        job  salary
0   John   20    student       0
1  Jenny   30  developer       0
2   Nate   30    teacher       0
3  Julia   40    dentist       0
4  Brian   45    manager       0
5  Chris   25     intern       0

## Column 내용 수정하기

In [26]:
import numpy as np
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')

In [27]:
df.head()

    name  age        job salary
0   John   20    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes
3  Julia   40    dentist    yes
4  Brian   45    manager    yes

In [28]:
df_list = [
    ['John', 80, 90],
    ['Park', 70, 75],
    ['Yoon', 100, 69]
]

## 모든 행 바꾸기

In [29]:
df = pd.DataFrame(df_list, columns=['name', 'midterm', 'final'])

In [30]:
df

   name  midterm  final
0  John       80     90
1  Park       70     75
2  Yoon      100     69

In [31]:
df['total'] = df['midterm'] + df['final']
df

   name  midterm  final  total
0  John       80     90    170
1  Park       70     75    145
2  Yoon      100     69    169

In [32]:
df['average'] = df['total']/2
df

   name  midterm  final  total  average
0  John       80     90    170     85.0
1  Park       70     75    145     72.5
2  Yoon      100     69    169     84.5

In [33]:
grades = []

for row in df['average']:
    if row >= 90 : grades.append('A')
    elif row >= 80 : grades.append('B')
    else : grades.append('C')

df['grade'] = grades

In [34]:
df

   name  midterm  final  total  average grade
0  John       80     90    170     85.0     B
1  Park       70     75    145     72.5     C
2  Yoon      100     69    169     84.5     B

In [35]:
def pass_or_fail(row):
    if(row == 'C') : return 'fail'
    else : return 'pass'

df.grade = df.grade.apply(pass_or_fail)
df

   name  midterm  final  total  average grade
0  John       80     90    170     85.0  pass
1  Park       70     75    145     72.5  fail
2  Yoon      100     69    169     84.5  pass

## 데이터프레임 합치기

In [36]:
df2_list = [
    {'name' : 'Jane', 'midterm': 90, 'final': 86}
]

df2 = pd.DataFrame(df2_list)
df2

   name  midterm  final
0  Jane       90     86

In [37]:
df.append(df2, ignore_index=True)

   name  midterm  final  total  average grade
0  John       80     90  170.0     85.0  pass
1  Park       70     75  145.0     72.5  fail
2  Yoon      100     69  169.0     84.5  pass
3  Jane       90     86    NaN      NaN   NaN

## 데이터그룹만들기

In [38]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"}
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [39]:
groupby_major = df.groupby('major')
groupby_major

In [40]:
groupby_major.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [41]:
for name, group in groupby_major:
    print(name + ' : ' + str(len(group)))
    print(group)
    print()

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 3
    name      major     sex
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female

Physics : 1
      name    major   sex
2  Abraham  Physics  male

Psychology : 3
     name       major     sex
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female

In [42]:
df_count_major = pd.DataFrame({'count' : groupby_major.size()})
df_count_major

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

## 중복 데이터 삭제

In [43]:
student_list = [{'name': 'John', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Abraham', 'major': "Physics", 'sex': "male"},
                {'name': 'Brian', 'major': "Psychology", 'sex': "male"},
                {'name': 'Janny', 'major': "Economics", 'sex': "female"},
                {'name': 'Yuna', 'major': "Economics", 'sex': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'sex': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'sex': "male"},
                {'name': 'Zara', 'major': "Psychology", 'sex': "female"},
                {'name': 'Wendy', 'major': "Economics", 'sex': "female"},
                {'name': 'Sera', 'major': "Psychology", 'sex': "female"},
                {'name': 'John', 'major': "Computer Science", 'sex': "male"},
         ]
df = pd.DataFrame(student_list, columns = ['name', 'major', 'sex'])
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female
11      John  Computer Science    male

In [44]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [45]:
df.drop_duplicates()

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

### 이름이 중복인 것을 제거

In [46]:
df.duplicated(['name'])

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
dtype: bool

In [48]:
df.drop_duplicates(['name'], keep='first')   # keep : 처음 나온걸 살리는가 지우는가 ex. keep='last'

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

## NaN데이터 찾아 바꾸기

In [61]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
                {'name': 'Brian', 'job': "student", 'age': 12},
                {'name': 'Janny', 'job': "student", 'age': 11},
                {'name': 'Nate', 'job': "teacher", 'age': None},
                {'name': 'John', 'job': "student", 'age': None}
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN

In [51]:
df.shape

(8, 3)

In [52]:
df.info

<bound method DataFrame.info of       name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   NaN
7     John  student   NaN>

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   job     8 non-null      object
 2   age     6 non-null      float64
dtypes: float64(1), object(2)
memory usage: 320.0+ bytes

In [55]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False
6  False  False   True
7  False  False   True

### NaN값을 다른 값로 바꾸기

In [56]:
df.age = df.age.fillna(0)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher   0.0
7     John  student   0.0

In [62]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace=True)
df

      name      job   age
0     John  teacher  40.0
1     Nate  teacher  35.0
2     Yuna  teacher  37.0
3  Abraham  student  10.0
4    Brian  student  12.0
5    Janny  student  11.0
6     Nate  teacher  37.0
7     John  student  11.0

In [65]:
df.groupby('job').age.transform('median') # 값을 median으로 모두 바꾸어버린다.

0    37.0
1    37.0
2    37.0
3    11.0
4    11.0
5    11.0
6    37.0
7    11.0
Name: age, dtype: float64

## apply, map, applymap

- yyyy-mm-dd 형식에서 yyyy추출 및 현재 나이 계산

```python
def get_year(date):
    return date.split('-')[0]

df['year'] = df['yyyy-mm-dd'].apply(get_year)

def get_age(year, cur_year):
    return cur_year - year

df['age'] = df['year'].apply(get_age, cur_year=2021)
```

- map함수이용

```python
df['job'] = df['job'].map({'student':1, 'teacher':2, 'soilder':3})

```

- applymap 함수이용

```python
import numpy as np

df = df.applymap(np.around) # 모든 값을 반올림한다
```

### 결론 : 컬럼 하나만 바꾸고 싶다면 apply, map 사용, 데이터프레임 전부 다 바꾸고 싶다면 applymap

## Unique한 value 뽑아내기

In [67]:
job_list = [{'name': 'John', 'job': "teacher"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Fred', 'job': "teacher"},
                {'name': 'Abraham', 'job': "student"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Janny', 'job': "developer"},
                {'name': 'Nate', 'job': "teacher"},
                {'name': 'Obrian', 'job': "dentist"},
                {'name': 'Yuna', 'job': "teacher"},
                {'name': 'Rob', 'job': "lawyer"},
                {'name': 'Brian', 'job': "student"},
                {'name': 'Matt', 'job': "student"},
                {'name': 'Wendy', 'job': "banker"},
                {'name': 'Edward', 'job': "teacher"},
                {'name': 'Ian', 'job': "teacher"},
                {'name': 'Chris', 'job': "banker"},
                {'name': 'Philip', 'job': "lawyer"},
                {'name': 'Janny', 'job': "basketball player"},
                {'name': 'Gwen', 'job': "teacher"},
                {'name': 'Jessy', 'job': "student"}
         ]
df = pd.DataFrame(job_list, columns = ['name', 'job'])

In [68]:
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7    Obrian            dentist
8      Yuna            teacher
9       Rob             lawyer
10    Brian            student
11     Matt            student
12    Wendy             banker
13   Edward            teacher
14      Ian            teacher
15    Chris             banker
16   Philip             lawyer
17    Janny  basketball player
18     Gwen            teacher
19    Jessy            student

In [69]:
df.job.unique()

array(['teacher', 'student', 'developer', 'dentist', 'lawyer', 'banker',
       'basketball player'], dtype=object)

In [71]:
df.job.value_counts() # 직업당 몇명?

teacher              8
student              5
banker               2
lawyer               2
developer            1
dentist              1
basketball player    1
Name: job, dtype: int64

## 데이터프레임 합치기

In [72]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'job': "dentist"},
      {'name': 'Jack', 'job': "farmer"},
      {'name': 'Ted', 'job': "designer"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'job'])

In [77]:
result = pd.concat([df1, df2]) # index가 똑같이 들어감

In [78]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

In [79]:
result = pd.concat([df1, df2], ignore_index = True) # 원 index 무시

In [80]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [81]:
result = df1.append(df2, ignore_index = True) # append함수 이용

In [82]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

In [83]:
l1 = [{'name': 'John', 'job': "teacher"},
      {'name': 'Nate', 'job': "student"},
      {'name': 'Jack', 'job': "developer"}]

l2 = [{'age': 25, 'country': "U.S"},
      {'age': 30, 'country': "U.K"},
      {'age': 45, 'country': "Korea"}]
         
df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['age', 'country'])
result = pd.concat([df1, df2], axis=1, ignore_index=True) # axis=1 : 행이 아니라 열로 합쳐라!
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Jack  developer  45  Korea

### 리스트 두 개를 한 데이터 프레임으로 넣기

In [84]:
label = [1,2,3,4,5]
prediction = [1,2,2,5,5]

comparison = pd.DataFrame(
    {'label': label,
     'prediction': prediction
    })

comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           5
4      5           5